ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM362.xml
				<register>
					<name>CLKDIS</name>
					<description>System Clocks Control Register 1</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>DISADCCLK</name>
							<description>Disable ADC system clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDMACLK</name>
							<description>Disable DMA system clock</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDACCLK</name>
							<description>Disable DAC system clock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST1CLK</name>
							<description>Disable Timer 1 system clock</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST0CLK</name>
							<description>Disable Timer 0 system clock</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISPWMCLK</name>
							<description>Disable PWM system clock</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUART0CLK</name>
							<description>Disable UART0 system clock</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISI2CCLK</name>
							<description>Disable I2C system clock</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI1CLK</name>
							<description>Disable SPI1 system clock</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI0CLK</name>
							<description>Disable SPI0 system clock bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                           <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
            <register>
					<name>CLKCON2</name>
					<description>System Clocks Control Register 2</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>DACCD</name>
							<description>Clock divide bits for DAC system clock</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV8</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
                  <field>
							<name>UART2CD</name>
							<description>Clock divide bits for UART2 system clock</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>                  <field>
							<name>UART1CD</name>
							<description>Clock divide bits for UART1 system clock</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
                  <field>
							<name>DISUART2CLK</name>
							<description>Disable UART2 system clock</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUART1CLK</name>
							<description>Disable UART1 system clock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
               </fields>
				</register>
				<register>
					<name>XOSCCON</name>
					<description>Crystal Oscillator control</description>
					<addressOffset>0x00000410</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIV2</name>
							<description>Divide by two enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Crystal oscillator circuit enable (Enable the oscillator circuitry.)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKSYSDIV</name>
					<description>Sys Clock div Register</description>
					<addressOffset>0x00000444</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLKSEL</name>
							<description>Clock divide bits for root system clock</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
