ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM362.xml
				<register>
					<name>I2CSSTA</name>
             <description>Slave I2C Status, Error and IRQ Register</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>START</name>
							<description>Start and matching address</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REPSTART</name>
							<description>Repeated start and matching address</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDMAT</name>
							<description>Device ID matched</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop after start and matching address</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GCID</name>
							<description>General ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GCINT</name>
							<description>General call</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Slave busy</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NOACK</name>
							<description>Ack not generated by the slave</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXOF</name>
							<description>Receive FIFO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXREQ</name>
							<description>Receive</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXREQ</name>
							<description>Transmit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXUR</name>
							<description>Transmit FIFO underflow</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFSEREQ</name>
							<description>Tx FIFO status or early request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CSRX</name>
             <description>Slave Receive Data Register</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Receive register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CSTX</name>
             <description>Slave Transmit Data Register</description>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000010</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Transmit register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CALT</name>
             <description>Hardware General Call ID</description>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Alt register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID0</name>
             <description>1st Slave Address Device ID</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID1</name>
             <description>2nd Slave Address Device ID</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID2</name>
             <description>3rd Slave Address Device ID</description>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID3</name>
             <description>4th Slave Address Device ID</description>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CFSTA</name>
             <description>Master and Slave Rx/Tx FIFO Status Register</description>
					<addressOffset>0x0000004C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MFLUSH</name>
							<description>Flush the master transmit FIFO</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SFLUSH</name>
							<description>Flush the slave transmit FIFO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MRXFSTA</name>
							<description>Master receive FIFO Status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MTXFSTA</name>
							<description>Master Transmit FIFO Status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRXFSTA</name>
							<description>Slave receive FIFO Status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STXFSTA</name>
							<description>Slave Transmit FIFO Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
