ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM362.xml
         <register>
             <name>ICPR0</name>
             <description>IRQ0..31 Clear_Pending</description>
             <addressOffset>0x00000280</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>DMADAC</name>
                 <description>TBD</description>
                 <bitOffset>31</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAI2CMRX</name>
                 <description>TBD</description>
                 <bitOffset>30</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAI2CMTX</name>
                 <description>TBD</description>
                 <bitOffset>29</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAI2CSRX</name>
                 <description>TBD</description>
                 <bitOffset>28</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAI2CSTX</name>
                 <description>TBD</description>
                 <bitOffset>27</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAUARTRX</name>
                 <description>TBD</description>
                 <bitOffset>26</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAUARTTX</name>
                 <description>TBD</description>
                 <bitOffset>25</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMASPI1RX</name>
                 <description>TBD</description>
                 <bitOffset>24</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMASPI1TX</name>
                 <description>TBD</description>
                 <bitOffset>23</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DMAERROR</name>
                 <description>TBD</description>
                 <bitOffset>22</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>I2CM</name>
                 <description>TBD</description>
                 <bitOffset>21</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>I2CS</name>
                 <description>TBD</description>
                 <bitOffset>20</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SPI1</name>
                 <description>TBD</description>
                 <bitOffset>19</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SPI0</name>
                 <description>TBD</description>
                 <bitOffset>18</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>UART</name>
                 <description>TBD</description>
                 <bitOffset>17</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>FEE</name>
                 <description>TBD</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SINC2</name>
                 <description>TBD</description>
                 <bitOffset>15</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ADC1</name>
                 <description>TBD</description>
                 <bitOffset>14</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ADC0</name>
                 <description>TBD</description>
                 <bitOffset>13</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>T1</name>
                 <description>TBD</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>T0</name>
                 <description>TBD</description>
                 <bitOffset>11</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>T3</name>
                 <description>TBD</description>
                 <bitOffset>9</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT7</name>
                 <description>TBD</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT6</name>
                 <description>TBD</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT5</name>
                 <description>TBD</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT4</name>
                 <description>TBD</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT3</name>
                 <description>TBD</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>EXTINT2</name>
                 <description>TBD</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
