ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM362.xml
         <register>
             <name>CFSR</name>
             <description>Configurable Fault Status</description>
             <addressOffset>0x00000D28</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>DIVBYZERO</name>
                 <description>Divide by zero error</description>
                 <bitOffset>25</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>UNALIGNED</name>
                 <description>Unaligned access error</description>
                 <bitOffset>24</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>NOCP</name>
                 <description>Coprocessor access error</description>
                 <bitOffset>19</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>INVPC</name>
                 <description>Integrity check error on EXC_RETURN</description>
                 <bitOffset>18</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>INVSTATE</name>
                 <description>Invalid EPSR.T bit or illegal EPSR.IT bits for executing</description>
                 <bitOffset>17</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>UNDEFINSTR</name>
                 <description>Undefined instruction executed</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>BFARVALID</name>
                 <description>This bit is set if the BFAR register has valid contents</description>
                 <bitOffset>15</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>STKERR</name>
                 <description>This bit indicates a derived bus fault has occurred on exception entry</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>UNSTKERR</name>
                 <description>This bit indicates a derived bus fault has occurred on exception return</description>
                 <bitOffset>11</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IMPRECISERR</name>
                 <description>Imprecise data access error</description>
                 <bitOffset>10</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PRECISERR</name>
                 <description>Precise data access error. The BFAR is written with the faulting address</description>
                 <bitOffset>9</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IBUSERR</name>
                 <description>This bit indicates a bus fault on an instruction prefetch</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>MMARVALID</name>
                 <description>This bit is set if the MMAR register has valid contents.</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>MSTKERR</name>
                 <description>A derived MemManage fault has occurred on exception entry</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>MUNSTKERR</name>
                 <description>A derived MemManage fault has occurred on exception return</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DACCVIOL</name>
                 <description>Data access violation. The MMAR is set to the data address which the load store tried to access.</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IACCVIOL</name>
                 <description>violation on an instruction fetch.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
         </register>
         <register>
             <name>HFSR</name>
             <description>Hard Fault Status</description>
             <addressOffset>0x00000D2C</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>DEBUGEVT</name>
                 <description>Debug event, and the Debug Fault Status Register has been updated.</description>
                 <bitOffset>31</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>FORCED</name>
                 <description>Configurable fault cannot be activated due to priority or it was disabled. Priority escalated to a HardFault.</description>
                 <bitOffset>30</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>VECTTBL</name>
                 <description>Fault was due to vector table read on exception processing</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
         </register>
         <register>
             <name>MMFAR</name>
             <description>Mem Manage Address</description>
             <addressOffset>0x00000D34</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>ADDRESS</name>
                 <description>Data address MPU faulted.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>BFAR</name>
             <description>Bus Fault Address</description>
             <addressOffset>0x00000D38</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>ADDRESS</name>
                 <description>Updated on precise data access faults</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>STIR</name>
             <description>Software Trigger Interrupt Register</description>
             <addressOffset>0x00000F00</addressOffset>
             <size>0x00000020</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>INTID</name>
                 <description>The value written in this field is the interrupt to be triggered.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>10</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000003FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
